project/src/Enums/СостоянияПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СостоянияПравил</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТестировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяАлгоритмКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/СвойстваФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СвойстваФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектХранительСвойств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбщегоСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ТипыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ТипыФормата</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВерсииФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВключатьВОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменБазовогоТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/Конфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Конфигурации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьТегВырезки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьПодчиненныеКонфигурации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конфигурация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/CommonModules/ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы КонвертацияДанныхXDTOВызовСервера.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "КонвертацияДанных";
	Описание.Версия = "3.1.5.35";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Последовательно";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ОбработатьИнформациюОТипах";
	Обработчик.Комментарий = НСтр("ru = 'Обработка информации о типах в справочниках СвойстваФормата и ТипыФормата.'");
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьНастройкуИспользоватьПроектированиеФормата";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новой константы ИспользоватьПроектированиеФормата.'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьВерсиюФорматаМенеджераВКонвертациях";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового реквизита ВерсияФорматаМенеджера в справочнике Конвертации'");
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьГруппуПравилСтрокой";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового реквизита ""ГруппаСтрокой"" в справочниках ""Алгоритмы"",
		|""Правила конвертации объектов"", ""Правила конвертации предопределенных данных"", ""Правила обработки данных""'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьТипИСтатусКонвертаций";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новых реквизитов ТипКонвертации и Статус в справочнике Конвертации'");
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьСправочникПКС";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового справочника Правила конвертации свойств'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьРодителяВВерсияхФормата";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение родителя в версиях формата'");
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьКонфигурациюВРелизах";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение конфигурации владельца в релизах'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьОбъектыВПравилах";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на объекты в правилах'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьСвойстваВПравилах";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на свойства в правилах конвертации свойств'");
	Обработчик.РежимВыполнения = "Оперативно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.РаспределитьКонвертацииПоПапкам";
	Обработчик.Комментарий = НСтр("ru = 'Распределение конвертаций с пустым родителем по предопределенным папкам'");
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.3.26";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьПризнакПровереноУПКС";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение признака Проверено у правил конвертации свойств'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8ea46e12-2013-4fb9-a30c-dd613fd242b5");
	Обработчик.БлокируемыеОбъекты = "Справочник.ПравилаКонвертацииСвойств";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ПризнакПровереноВПКСЗаполнен";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.5.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ЗаполнитьТегиПравилРегистрации";
	Обработчик.Комментарий = НСтр("ru = 'Перенос тегов в правилах регистрации из строкового реквизита в табличную часть'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9d0abae8-f3d3-4f87-884e-0d720c94e198");
	Обработчик.БлокируемыеОбъекты = "Справочник.ПравилаРегистрацииОбъектов";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ТегиПравилРегистрацииЗаполнены";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.5.25";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ПеренестиОписанияОбъектовИСвойствФормата";
	Обработчик.Комментарий = НСтр("ru = 'Перенос описаний объектов и свойств формата в элементы описаний'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6e186247-06e4-4576-aa14-b98d2ced6d92");
	Обработчик.БлокируемыеОбъекты = "Справочник.ЭлементыОписания";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазыКонвертацияДанныхXDTO.ПереносОписанийЗакончен";

КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры 

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#Область ОбработчикиОбновления
// Обработка информации о типах в справочниках СвойстваФормата и ТипыФормата
Процедура ОбработатьИнформациюОТипах() Экспорт
	// Справочник Свойства формата.
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 10000
	|	СвойстваФормата.Ссылка,
	|	ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(1000)) КАК СвойствоТип
	|ИЗ Справочник.СвойстваФормата КАК СвойстваФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата.Состав КАК СоставФормата
	|ПО СвойстваФормата.Ссылка = СоставФормата.Ссылка
	|ГДЕ НЕ СвойстваФормата.ПометкаУдаления И СоставФормата.Ссылка IS NULL
	|	И НЕ СвойстваФормата.ЭтоГруппа";
	Пока Истина Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СвойствоОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если Найти(Выборка.СвойствоТип, ";") > 0 Тогда
				МассивТипов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СвойствоОбъект.Тип,";");
				Для Каждого ТекТип Из МассивТипов Цикл
					НовСтр = СвойствоОбъект.Состав.Добавить();
					НовСтр.ТипФормата = СокрЛП(ТекТип);
				КонецЦикла;
				СвойствоОбъект.СоставнойТип = Истина;
			Иначе
				НовСтр = СвойствоОбъект.Состав.Добавить();
				НовСтр.ТипФормата = СокрЛП(Выборка.СвойствоТип);
			КонецЕсли;
			// Целенаправленно обрезаем тип до 1000 знаков.
			СвойствоОбъект.Тип = Выборка.СвойствоТип;
			СвойствоОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	// Справочник Типы формата.
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 10000
	|	ТипыФормата.Ссылка,
	|	ТипыФормата.БазовыйТип КАК БазовыйТип
	|ИЗ Справочник.ТипыФормата КАК ТипыФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата.Состав КАК СоставФормата
	|ПО ТипыФормата.Ссылка = СоставФормата.Ссылка
	|ГДЕ НЕ ТипыФормата.ПометкаУдаления 
	|	И СоставФормата.Ссылка IS NULL И ТипыФормата.БазовыйТип <>""""";
	Пока Истина Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.БазовыйТип) Тогда
				Продолжить;
			КонецЕсли;
			ТипОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НовСтр = ТипОбъект.Состав.Добавить();
			НовСтр.ТипФормата = СокрЛП(Выборка.БазовыйТип);
			ТипОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Заполнение новой константы ИспользоватьПроектированиеФормата.
Процедура ЗаполнитьНастройкуИспользоватьПроектированиеФормата() Экспорт
	Если Константы.ИспользоватьПроектированиеФормата.Получить() Тогда
		Возврат;
	КонецЕсли;
	СпрВыборка = Справочники.Описания.Выбрать();
	Пока СпрВыборка.Следующий() Цикл
		Если СпрВыборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Константы.ИспользоватьПроектированиеФормата.Установить(Истина);
		Прервать;
	КонецЦикла;
КонецПроцедуры

// Заполнение нового реквизита ВерсияФорматаМенеджера в справочнике Конвертации
Процедура ЗаполнитьВерсиюФорматаМенеджераВКонвертациях() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка
	|ИЗ Справочник.Конвертации
	|ГДЕ ВерсияФорматаМенеджера = """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КонвертацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонвертацияОбъект.ВерсияФорматаМенеджера = "1";
		КонвертацияОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Заполнение нового реквизита ГруппаСтрокой в справочниках Алгоритмы,
//  Правила конвертации объектов, Правила конвертации предопределенных данных, Правила обработки данных
Процедура ЗаполнитьГруппуПравилСтрокой() Экспорт
	
	ТаблицаГруппыПравил = Новый ТаблицаЗначений;
	ТаблицаГруппыПравил.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.УдалитьГруппыПравил"));
	ТаблицаГруппыПравил.Колонки.Добавить("ПолноеНаименование", Новый ОписаниеТипов("Строка"));
	
	ЗаполнитьТаблицуГруппПравил(ТаблицаГруппыПравил, Справочники.УдалитьГруппыПравил.ПустаяСсылка());
	ПреобразованныеГруппы = Новый Соответствие;
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Алгоритмы.Ссылка КАК Ссылка,
	|	Алгоритмы.УдалитьГруппа КАК Группа
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ГДЕ
	|	(ВЫРАЗИТЬ(Алгоритмы.ГруппаПравил КАК СТРОКА(100))) = """"
	|	И Алгоритмы.УдалитьГруппа <> ЗНАЧЕНИЕ(Справочник.УдалитьГруппыПравил.ПустаяСсылка)";
	ЗаполнитьГруппуПравилСтрокойИзЗапроса(ТаблицаГруппыПравил, Запрос, ПреобразованныеГруппы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаКонвертацииОбъектов.Ссылка КАК Ссылка,
	|	ПравилаКонвертацииОбъектов.УдалитьГруппа КАК Группа
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|ГДЕ
	|	(ВЫРАЗИТЬ(ПравилаКонвертацииОбъектов.ГруппаПравил КАК СТРОКА(100))) = """"
	|	И ПравилаКонвертацииОбъектов.УдалитьГруппа <> ЗНАЧЕНИЕ(Справочник.УдалитьГруппыПравил.ПустаяСсылка)";
	ЗаполнитьГруппуПравилСтрокойИзЗапроса(ТаблицаГруппыПравил, Запрос, ПреобразованныеГруппы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаКонвертацииПредопределенныхДанных.Ссылка КАК Ссылка,
	|	ПравилаКонвертацииПредопределенныхДанных.УдалитьГруппа КАК Группа
	|ИЗ
	|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПравилаКонвертацииПредопределенныхДанных
	|ГДЕ
	|	(ВЫРАЗИТЬ(ПравилаКонвертацииПредопределенныхДанных.ГруппаПравил КАК СТРОКА(100))) = """"
	|	И ПравилаКонвертацииПредопределенныхДанных.УдалитьГруппа <> ЗНАЧЕНИЕ(Справочник.УдалитьГруппыПравил.ПустаяСсылка)";
	ЗаполнитьГруппуПравилСтрокойИзЗапроса(ТаблицаГруппыПравил, Запрос, ПреобразованныеГруппы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаОбработкиДанных.Ссылка КАК Ссылка,
	|	ПравилаОбработкиДанных.УдалитьГруппа КАК Группа
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПравилаОбработкиДанных
	|ГДЕ
	|	(ВЫРАЗИТЬ(ПравилаОбработкиДанных.ГруппаПравил КАК СТРОКА(100))) = """"
	|	И ПравилаОбработкиДанных.УдалитьГруппа <> ЗНАЧЕНИЕ(Справочник.УдалитьГруппыПравил.ПустаяСсылка)";
	ЗаполнитьГруппуПравилСтрокойИзЗапроса(ТаблицаГруппыПравил, Запрос, ПреобразованныеГруппы);
	
КонецПроцедуры

// Заполнение новых реквизитов ТипКонвертации и Статус в справочнике Конвертации.
Процедура ЗаполнитьТипИСтатусКонвертаций() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Конвертации.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ЭтоКонвертация,
	|	Конвертации.Статус КАК Статус
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ
	|	Конвертации.ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.ПустаяСсылка)
	|	ИЛИ Конвертации.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияПравил.ПустаяСсылка)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка КАК Ссылка,
	|	ЛОЖЬ,
	|	NULL
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК Правило
	|ГДЕ Правило.ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.ПустаяСсылка)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка КАК Ссылка,
	|	ЛОЖЬ,
	|	NULL
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК Правило
	|ГДЕ Правило.ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.ПустаяСсылка)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка КАК Ссылка,
	|	ЛОЖЬ,
	|	NULL
	|ИЗ
	|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правило
	|ГДЕ Правило.ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.ПустаяСсылка)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка КАК Ссылка,
	|	ЛОЖЬ,
	|	NULL
	|ИЗ
	|	Справочник.Алгоритмы КАК Правило
	|ГДЕ Правило.ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.ПустаяСсылка)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КонвертацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонвертацияОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
		Если Выборка.ЭтоКонвертация И НЕ ЗначениеЗаполнено(Выборка.Статус) Тогда
			КонвертацияОбъект.Статус = Перечисления.СостоянияПравил.ВРаботе;
			
			РегистрСтатусы = РегистрыСведений.СтатусыПравил.СоздатьМенеджерЗаписи();
			РегистрСтатусы.Период = ТекущаяДатаСеанса();
			РегистрСтатусы.Объект = Выборка.Ссылка;
			РегистрСтатусы.Статус = Перечисления.СостоянияПравил.ВРаботе;
			РегистрСтатусы.Записать();
		КонецЕсли;
		КонвертацияОбъект.Записать();
	КонецЦикла;
	
	Константы.ИспользоватьФорматXDTO.Установить(Истина);
	Константы.ИспользоватьФорматXML.Установить(Истина);

КонецПроцедуры

// Заполнение нового справочника Правила конвертации свойств.
Процедура ЗаполнитьСправочникПКС() Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПКС.Ссылка КАК Владелец,
	|	ПКС.ГруппаСвойствКонфигурации,
	|	ПКС.ГруппаСвойствФормата,
	|	ПКС.ИспользуетсяАлгоритмКонвертации,
	|	ПКС.Комментарий,
	|	ПКС.ПолноеИмяСвойстваКонфигурации,
	|	ПКС.ПолноеИмяСвойстваФормата,
	|	ПКС.ПравилоКонвертацииСвойства,
	|	ПКС.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|	ПКС.СвойствоФормата,
	|	ПКС.ТипСвойстваКонфигурации,
	|	ПКС.ТипСвойстваФормата,
	|	ПКС.Ссылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|	ПКС.Ссылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов.УдалитьПравилаКонвертацииСвойств КАК ПКС
	|ГДЕ ПКС.Отключить = ЛОЖЬ
	|ИТОГИ ПО ПКС.Ссылка, ПКС.ГруппаСвойствКонфигурации, ПКС.ГруппаСвойствФормата";
	ВыборкаПКО = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПКО.Следующий() Цикл
		ВыборкаГСК = ВыборкаПКО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГСК.Следующий() Цикл
			ВыборкаГСФ = ВыборкаГСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаГСФ.Следующий() Цикл
				ТекущийРодитель = НайтиСоздатьГруппуСвойств(ВыборкаГСФ);
				Выборка = ВыборкаГСФ.Выбрать();
				ПКГСАлгоритм = Ложь;
				Пока Выборка.Следующий() Цикл
					СтруктураПоиска = Новый Структура("Владелец, СвойствоКонфигурации, СвойствоФормата",
						Выборка.Владелец, Выборка.СвойствоКонфигурации, 
						Выборка.СвойствоФормата);
					СтруктураПоиска.Вставить("ЭтоГруппа", Ложь);
					СтруктураПоиска.Вставить("Родитель", ТекущийРодитель);
					РезультатПоиска = НайтиПКС(СтруктураПоиска);
					Если РезультатПоиска <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					НовоеСвойство = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
					НовоеСвойство.Владелец = Выборка.Владелец;
					НовоеСвойство.Родитель = ТекущийРодитель;
					ЗаполнитьЗначенияСвойств(НовоеСвойство, Выборка,,"СвойствоКонфигурации");  
					НовоеСвойство.СвойствоКонфигурацииСтрокой = Выборка.СвойствоКонфигурации;
					НовоеСвойство.Наименование = СформироватьНаименование(Выборка.СвойствоКонфигурации, 
							Выборка.СвойствоФормата, Выборка.ИспользоватьДляОтправки, 
							Выборка.ИспользоватьДляПолучения);

					НовоеСвойство.Записать();
					Если НЕ ПКГСАлгоритм И Выборка.ИспользуетсяАлгоритмКонвертации Тогда
						ПКГСАлгоритм = Истина;
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(ТекущийРодитель) И ПКГСАлгоритм Тогда
					ТекущийПКГСАлгоритм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийРодитель, "ИспользуетсяАлгоритмКонвертации");
					Если НЕ ТекущийПКГСАлгоритм Тогда
						РодительОбъект = ТекущийРодитель.ПолучитьОбъект();
						РодительОбъект.ИспользуетсяАлгоритмКонвертации = Истина;
						РодительОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		// Обработаны все ПКС для ПКО. Очистка ТЧ ПКС в ПКО.
		ПКООбъект = ВыборкаПКО.Владелец.ПолучитьОбъект();
		ПКООбъект.УдалитьПравилаКонвертацииСвойств.Очистить();
		ПКООбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Заполнение родителя для существующих элементов справочника ВерсииФормата.
Процедура ЗаполнитьРодителяВВерсияхФормата() Экспорт
	// Заполнение пространства имен в предопределенной группе.
	ПространствоИмен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВерсииФормата.EnterpriseData, "ПространствоИмен");
	Если НЕ ЗначениеЗаполнено(ПространствоИмен) Тогда
		ВерсияОбъект = Справочники.ВерсииФормата.EnterpriseData.ПолучитьОбъект();
		ВерсияОбъект.ПространствоИмен = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData";
		ВерсияОбъект.Записать();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка
	|ИЗ Справочник.ВерсииФормата
	|ГДЕ Родитель = &Родитель И ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("Родитель", Справочники.ВерсииФормата.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерсияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ВерсияОбъект.Родитель = Справочники.ВерсииФормата.EnterpriseData;
		ВерсияОбъект.Записать();
	КонецЦикла; 
КонецПроцедуры

// Заполнение конфигурации-владельца для существующих элементов справочника Релизы.
Процедура ЗаполнитьКонфигурациюВРелизах() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка
	|ИЗ Справочник.Релизы
	|ГДЕ КонфигурацияВладелец = &КонфигурацияВладелец И ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("КонфигурацияВладелец", Справочники.Конфигурации.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерсияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ВерсияОбъект.КонфигурацияВладелец = Справочники.Конфигурации.НеизвестнаяКонфигурация;
		ВерсияОбъект.Записать();
	КонецЦикла; 
КонецПроцедуры

// Заполнение значений новых ссылочных реквизитов ОбъектКонфигурации, ОбъектКонфигурацииКорреспондент... 
//   на основании подлежащих удалению строковых реквизитов УдалитьОбъектКонфигурации, УдалитьОбъектКонфигурацииКорреспондент...
Процедура ЗаполнитьОбъектыВПравилах() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	// Правила конвертации объектов.
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.УдалитьОбъектКонфигурации КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектКонфигурации"" КАК ИмяРеквизита
	|ПОМЕСТИТЬ КОбработке
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
	|ГДЕ Правила.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) 
	|	И Правила.УдалитьОбъектКонфигурации <> """"
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.УдалитьОбъектКонфигурацииКорреспондент КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектКонфигурацииКорреспондент"" КАК ИмяРеквизита
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
	|ГДЕ Правила.ОбъектКонфигурацииКорреспондент = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) 
	|	И Правила.УдалитьОбъектКонфигурацииКорреспондент <> """"
	|ОБЪЕДИНИТЬ ВСЕ
	// Правила конвертации предопределенных данных.
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.УдалитьОбъектКонфигурации КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектКонфигурации"" КАК ИмяРеквизита
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правила
	|ГДЕ Правила.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) 
	|	И Правила.УдалитьОбъектКонфигурации <> """"
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.УдалитьОбъектКонфигурацииКорреспондент КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектКонфигурацииКорреспондент"" КАК ИмяРеквизита
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правила
	|ГДЕ Правила.ОбъектКонфигурацииКорреспондент = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) 
	|	И Правила.УдалитьОбъектКонфигурацииКорреспондент <> """"
	|ОБЪЕДИНИТЬ ВСЕ
	// Правила обработки данных
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектВыборки"" КАК ИмяРеквизита
	|ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
	|ГДЕ Правила.ИспользоватьДляОтправки 
	|	И НЕ Правила.ОбъектВыборки ССЫЛКА Справочник.Объекты
	|;
	|ВЫБРАТЬ
	|	КОбработке.Ссылка,
	|	КОбработке.ОбъектКонфигурацииСтрокой,
	|	КОбработке.ИмяРеквизита,
	|	Состав.Владелец.Конфигурация КАК Конфигурация 
	|ПОМЕСТИТЬ КЗаполнению
	|ИЗ КОбработке КАК КОбработке
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО КОбработке.Ссылка = Состав.ЭлементКонвертации
	|	И Состав.Отключить = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	// Правила регистрации объектов
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Правила.УдалитьОбъектНастройки КАК Строка(150)) КАК ОбъектКонфигурацииСтрокой,
	|	""ОбъектНастройки"" КАК ИмяРеквизита,
	|	Правила.Владелец.Конфигурация КАК Конфигурация
	|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
	|ГДЕ Правила.ОбъектНастройки = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|;  
	|ВЫБРАТЬ
	|	КЗаполнению.Ссылка,
	|	КЗаполнению.ОбъектКонфигурацииСтрокой,
	|	КЗаполнению.ИмяРеквизита,
	|	КЗаполнению.Конфигурация,
	|	Максимум(Объекты.Ссылка) КАК ОбъектКонфигурации
	|ИЗ КЗаполнению КАК КЗаполнению
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Объекты КАК Объекты
	|ПО Объекты.Владелец = КЗаполнению.Конфигурация
	|	И Объекты.Наименование = КЗаполнению.ОбъектКонфигурацииСтрокой
	|	И Объекты.ПометкаУдаления = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	КЗаполнению.Ссылка,
	|	КЗаполнению.ОбъектКонфигурацииСтрокой,
	|	КЗаполнению.ИмяРеквизита,
	|	КЗаполнению.Конфигурация";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПравилоОбъект[Выборка.ИмяРеквизита] = Выборка.ОбъектКонфигурации;
		ПравилоОбъект.ОбменДанными.Загрузка = Истина;
		ПравилоОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

// Заполнение значений новых ссылочных реквизитов СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента в правилах конвертации свойств.
Процедура ЗаполнитьСвойстваВПравилах() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	Правила.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
	|	Правила.Родитель КАК Родитель,
	|	ВЫРАЗИТЬ(Правила.СвойствоКонфигурацииСтрокой КАК Строка(150)) КАК СвойствоКонфигурацииСтрокой,
	|	ВЫРАЗИТЬ(Правила.Родитель.СвойствоКонфигурацииСтрокой КАК Строка(150)) КАК СвойствоРодительСтрокой,
	|	Правила.Владелец.ОбъектКонфигурации КАК Объект,
	|	""СвойствоКонфигурации"" КАК ИмяРеквизита
	|ПОМЕСТИТЬ КОбработке
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК Правила
	|ГДЕ Правила.СвойствоКонфигурации = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) 
	|	И Правила.СвойствоКонфигурацииСтрокой <> """"
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка,
	|	Правила.Ссылка.ЭтоГруппа,
	|	Правила.Родитель,
	|	ВЫРАЗИТЬ(Правила.УдалитьСвойствоКонфигурацииКорреспондента КАК Строка(150)),
	|	ВЫРАЗИТЬ(Правила.Родитель.УдалитьСвойствоКонфигурацииКорреспондента КАК Строка(150)),
	|	Правила.Владелец.ОбъектКонфигурацииКорреспондент,
	|	""СвойствоКонфигурацииКорреспондента""
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК Правила
	|ГДЕ Правила.СвойствоКонфигурацииКорреспондента = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) 
	|	И Правила.УдалитьСвойствоКонфигурацииКорреспондента <> """"
	|;  
	|ВЫБРАТЬ
	|	КОбработке.Ссылка,
	|	КОбработке.СвойствоКонфигурацииСтрокой,
	|	КОбработке.ИмяРеквизита,
	|	КОбработке.Объект,
	|	Максимум(Свойства.Ссылка) КАК СвойствоКонфигурации
	|ИЗ КОбработке КАК КОбработке
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Свойства КАК Свойства
	|ПО Свойства.Владелец = КОбработке.Объект
	|	И Свойства.Наименование = КОбработке.СвойствоКонфигурацииСтрокой
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|	И Свойства.ЭтоГруппа = КОбработке.ЭтоГруппа
	|	И (КОбработке.Родитель = ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
	|		ИЛИ КОбработке.СвойствоРодительСтрокой = Свойства.Родитель.Наименование)
	|СГРУППИРОВАТЬ ПО
	|	КОбработке.Ссылка,
	|	КОбработке.СвойствоКонфигурацииСтрокой,
	|	КОбработке.ИмяРеквизита,
	|	КОбработке.Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПравилоОбъект[Выборка.ИмяРеквизита] = Выборка.СвойствоКонфигурации;
		ПравилоОбъект.ОбменДанными.Загрузка = Истина;
		ПравилоОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

// Распределение конвертаций с пустым родителем по предопределенным папкам
Процедура РаспределитьКонвертацииПоПапкам() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка,
	|	ТипКонвертации
	|ИЗ Справочник.Конвертации
	|ГДЕ Родитель = ЗНАЧЕНИЕ(Справочник.Конвертации.ПустаяСсылка) И ЭтоГруппа = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Конвертация = Выборка.Ссылка.ПолучитьОбъект();
		Конвертация.Родитель = ?(Выборка.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO, Справочники.Конвертации.ФорматXDTO, Справочники.Конвертации.ФорматXML);
		Конвертация.Записать();
	КонецЦикла;
КонецПроцедуры

// Отложенный обработчик обновления. Заполняет  признак Проверено у существующих ПКС в значение Истина. 
// Параметры:
//  ПараметрыОбработчика - Структура - управляющая коллекция, см. документацию к подсистеме ОбновлениеИнформационнойБазы БСП.
//         Ключи:
//         * ОбработкаЗавершена - Булево - для того чтобы обработчик был вызван повторно для обработки следующей порции данных,
//                                         следует записать в него значение Ложь;
//         В структуру можно добавить произвольное количество свойств произвольных типов,
//         значения которых будут автоматически запоминаться между вызовами процедуры - обработчика отложенного обновления.
//
Процедура ЗаполнитьПризнакПровереноУПКС(ПараметрыОбработчика) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ПравилаКонвертацииСвойств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ
	|	ПравилаКонвертацииСвойств.Проверено = ЛОЖЬ
	|	И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ"; 
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПравилоКС = Выборка.Ссылка.ПолучитьОбъект();
		ПравилоКС.Проверено = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПравилоКС, Ложь, Ложь);
	КонецЦикла;
КонецПроцедуры

// Проверяет, все ли ПКС были обработаны процедурой ЗаполнитьПризнакПровереноУПКС()
//
// Параметры:
//   Параметры - Структура - см. документацию к БСП.
//
// Возвращаемое значение:
//   Булево - Истина, то можно редактировать и записывать данные,
//            Ложь - данные недоступны, пока не будут обработаны процедурой обновления.
//
Функция ПризнакПровереноВПКСЗаполнен(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаКонвертацииСвойств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ
	|	ПравилаКонвертацииСвойств.Проверено = ЛОЖЬ
	|	И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ";
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

// Отложенный обработчик обновления. Переносит теги правил регистрации из строкового реквизита в табличную часть. 
// Параметры:
//  ПараметрыОбработчика - Структура - управляющая коллекция, см. документацию к подсистеме ОбновлениеИнформационнойБазы БСП.
//         Ключи:
//         * ОбработкаЗавершена - Булево - для того чтобы обработчик был вызван повторно для обработки следующей порции данных,
//                                         следует записать в него значение Ложь;
//         В структуру можно добавить произвольное количество свойств произвольных типов,
//         значения которых будут автоматически запоминаться между вызовами процедуры - обработчика отложенного обновления.
//
Процедура ЗаполнитьТегиПравилРегистрации(ПараметрыОбработчика) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ПравилаРегистрацииОбъектов.Ссылка КАК Ссылка, 
	|	ПравилаРегистрацииОбъектов.УдалитьТегВырезки КАК ТегСтрокой,
	|	ПравилаРегистрацииОбъектов.Владелец КАК Регистрация
	|ИЗ
	|	Справочник.ПравилаРегистрацииОбъектов КАК ПравилаРегистрацииОбъектов
	|ГДЕ
	|	ВЫРАЗИТЬ(ПравилаРегистрацииОбъектов.УдалитьТегВырезки КАК Строка(50)) <> """"
	|	И ПравилаРегистрацииОбъектов.ЭтоГруппа = ЛОЖЬ";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПРООбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПРООбъект.Теги.Очистить();
		ТекущийТегМассив = СтрРазделить(СокрЛП(Выборка.ТегСтрокой), Символы.ПС);
		Для Каждого ТекТег Из ТекущийТегМассив Цикл
			ТекТегСсылка = НайтиСоздатьТег(Выборка.Регистрация, СокрЛП(ТекТег));
			Если ТекТегСсылка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрТег = ПРООбъект.Теги.Добавить();
			СтрТег.Тег = ТекТегСсылка;
		КонецЦикла;
		ПРООбъект.УдалитьТегВырезки = "";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПРООбъект, Ложь, Ложь);
	КонецЦикла;
КонецПроцедуры

// Проверяет, все ли ПравилаРегистрации были обработаны процедурой ЗаполнитьТегиПравилРегистрации()
//
// Параметры:
//   Параметры - Структура - см. документацию к БСП.
//
// Возвращаемое значение:
//   Булево - Истина, то можно редактировать и записывать данные,
//            Ложь - данные недоступны, пока не будут обработаны процедурой обновления.
//
Функция ТегиПравилРегистрацииЗаполнены(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаРегистрацииОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаРегистрацииОбъектов КАК ПравилаРегистрацииОбъектов
	|ГДЕ
	|	ВЫРАЗИТЬ(ПравилаРегистрацииОбъектов.УдалитьТегВырезки КАК Строка(50)) <> """"
	|	И ПравилаРегистрацииОбъектов.ЭтоГруппа = ЛОЖЬ";
	Возврат Запрос.Выполнить().Пустой();
КонецФункции 

// Отложенный обработчик обновления. Переносит описания из справочников ОбъектыФормата и СвойстваФормата в соответствующие элементы справочника ЭлементыОписания. 
// Параметры:
//  ПараметрыОбработчика - Структура - управляющая коллекция, см. документацию к подсистеме ОбновлениеИнформационнойБазы БСП.
//         Ключи:
//         * ОбработкаЗавершена - Булево - для того чтобы обработчик был вызван повторно для обработки следующей порции данных,
//                                         следует записать в него значение Ложь;
//         В структуру можно добавить произвольное количество свойств произвольных типов,
//         значения которых будут автоматически запоминаться между вызовами процедуры - обработчика отложенного обновления.
//
Процедура ПеренестиОписанияОбъектовИСвойствФормата(ПараметрыОбработчика) Экспорт
	Если Константы.ИспользоватьПроектированиеФормата.Получить() = Ложь Тогда
		Возврат;
	КонецЕсли;
	ЗапросОписания = Новый Запрос;
	ЗапросОписания.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Описание,
	|	НомерВерсииФормата КАК Номер
	|ИЗ Справочник.Описания
	|ГДЕ ПометкаУдаления = Ложь";
	ВыборкаНомераВерсий = ЗапросОписания.Выполнить().Выбрать();
	Пока ВыборкаНомераВерсий.Следующий() Цикл
		ВерсияФормата = Справочники.ВерсииФормата.НайтиПоНаименованию(ВыборкаНомераВерсий.Номер);
		Если НЕ ЗначениеЗаполнено(ВерсияФормата) Тогда
			Продолжить;
		КонецЕсли;
		// Уровень заголовка должен быть 1 для элементов которые не заголовки.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|ИЗ Справочник.ЭлементыОписания КАК ЭлементОписания
		|ГДЕ ЭлементОписания.ТипЭлемента <> ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.Заголовок)
		|	И ЭлементОписания.УровеньЗаголовка <> 1";
		Запрос.УстановитьПараметр("Описание", ВыборкаНомераВерсий.Описание);
		ВыборкаЭлементОписания = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЭлементОписания.Следующий() Цикл
			ТекЭлементОписания = ВыборкаЭлементОписания.Ссылка.ПолучитьОбъект();
			ТекЭлементОписания.УровеньЗаголовка = 1;
			ТекЭлементОписания.ОбменДанными.Загрузка = Истина;
			ТекЭлементОписания.Записать();
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЭлементОписания.Ссылка КАК ЭлементОписания,
		|	ОбъектыФормата.УдалитьОписание КАК Описание,
		|	ОбъектыФормата.Ссылка КАК ОбъектФормата
		|ИЗ Справочник.ЭлементыОписания КАК ЭлементОписания
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
		|	ПО ЭлементОписания.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
		|	И ОбъектыФормата.Владелец = &ВерсияФормата
		|	И ОбъектыФормата.Наименование = ЭлементОписания.ОбъектФормата
		|	И ОбъектыФормата.ПереносОписанийВыполнен = ЛОЖЬ
		|ГДЕ ЭлементОписания.Владелец = &Описание";
		Запрос.УстановитьПараметр("Описание", ВыборкаНомераВерсий.Описание);
		Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
		ВыборкаЭлементОписания = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЭлементОписания.Следующий() Цикл
			ТекЭлементОписания = ВыборкаЭлементОписания.ЭлементОписания.ПолучитьОбъект();
			ТекЭлементОписания.ТекстПростогоОписания = Новый ХранилищеЗначения(ВыборкаЭлементОписания.Описание.Получить());
			// Описания для свойств.
			ЗапросСвойства = Новый Запрос;
			ЗапросСвойства.Текст = "ВЫБРАТЬ
			|	Ссылка КАК Свойство,
			|	Наименование,
			|	Родитель.Наименование КАК НаименованиеТЧ,
			|	Родитель.ОбъектХранительСвойств КАК РодительОбъектХранительСвойств,
			|	ЭтоГруппа,
			|	УдалитьОписание КАК Описание
			|ИЗ Справочник.СвойстваФормата
			|ГДЕ Владелец = &ОбъектФормата И ОбъектХранительСвойств = """"";
			ЗапросСвойства.УстановитьПараметр("ОбъектФормата", ВыборкаЭлементОписания.ОбъектФормата);
			ВыборкаСвойства = ЗапросСвойства.Выполнить().Выбрать();
			ТекЭлементОписания.ОписанияРеквизитовШапки.Очистить();
			ТекЭлементОписания.ОписанияРеквизитовТабличнойЧасти.Очистить();
			Пока ВыборкаСвойства.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаСвойства.РодительОбъектХранительСвойств) Тогда
					Продолжить;
				КонецЕсли;
				ДанныеОписания = ВыборкаСвойства.Описание.Получить();
				Если ДанныеОписания = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ТекстОписания = ДанныеОписания.ПолучитьТекст();
				Если ТекстОписания = "" Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСвойства.НаименованиеТЧ) Тогда
					НовОписаниеСвойства = ТекЭлементОписания.ОписанияРеквизитовТабличнойЧасти.Добавить();
				Иначе
					НовОписаниеСвойства = ТекЭлементОписания.ОписанияРеквизитовШапки.Добавить();
				КонецЕсли; 
				ЗаполнитьЗначенияСвойств(НовОписаниеСвойства, ВыборкаСвойства); 
				НовОписаниеСвойства.ТекстОписания = ТекстОписания;
				НовОписаниеСвойства.СобственноеОписание = Истина;
			КонецЦикла;
			ТекЭлементОписания.ОбменДанными.Загрузка = Истина;
			ТекЭлементОписания.Записать();
			
			// Фиксируем факт обработки объекта формата.
			ТекОбъектФормата = ВыборкаЭлементОписания.ОбъектФормата.ПолучитьОбъект();
			ТекОбъектФормата.ПереносОписанийВыполнен = Истина;
			ТекОбъектФормата.ОбменДанными.Загрузка = Истина;
			ТекОбъектФормата.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Проверяет, все ли ОбъектыФормата были обработаны процедурой ПеренестиОписанияОбъектовИСвойствФормата()
//
// Параметры:
//   Параметры - Структура - см. документацию к БСП.
//
// Возвращаемое значение:
//   Булево - Истина, то можно редактировать и записывать данные,
//            Ложь - данные недоступны, пока не будут обработаны процедурой обновления.
//
Функция ПереносОписанийЗакончен(Параметры) Экспорт
	Если Константы.ИспользоватьПроектированиеФормата.Получить() = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НомерВерсииФормата КАК Номер
	|ИЗ Справочник.Описания
	|ГДЕ ПометкаУдаления = Ложь";
	МасНомераВерсий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлементОписания.Ссылка КАК ЭлементОписания,
	|	ОбъектыФормата.Ссылка КАК ОбъектФормата
	|ИЗ Справочник.ЭлементыОписания КАК ЭлементОписания
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|	ПО ЭлементОписания.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
	|	И ОбъектыФормата.Владелец.Наименование = ЭлементОписания.Владелец.НомерВерсииФормата
	|	И ОбъектыФормата.Наименование = ЭлементОписания.ОбъектФормата
	|ГДЕ ЭлементОписания.Владелец.НомерВерсииФормата В (&НомераВерсийСОписаниями) И ОбъектыФормата.ПереносОписанийВыполнен = ЛОЖЬ
	|";
	Запрос.УстановитьПараметр("НомераВерсийСОписаниями", МасНомераВерсий);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьТаблицуГруппПравил(ТаблицаГруппыПравил, Родитель)
	ПреобразованныеГруппы = Новый Соответствие();

	НаименованиеРодителя = "";
	СтрокаРодитель = ТаблицаГруппыПравил.Найти(Родитель, "Ссылка");
	Если Не СтрокаРодитель = Неопределено Тогда		
		НаименованиеРодителя = ЗаменитьНеправильныеСимволыВСтроке(СтрокаРодитель.ПолноеНаименование, ПреобразованныеГруппы);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГруппыПравил.Ссылка КАК Ссылка,
	|	ГруппыПравил.Наименование КАК Наименование
	|ИЗ
	|	Справочник.УдалитьГруппыПравил КАК ГруппыПравил
	|ГДЕ
	|	ГруппыПравил.Родитель = &Родитель");
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаГруппыПравил = ТаблицаГруппыПравил.Добавить();
		СтрокаГруппыПравил.Ссылка = Выборка.Ссылка;
		Если ПустаяСтрока(НаименованиеРодителя) Тогда
			СтрокаГруппыПравил.ПолноеНаименование = Выборка.Наименование;
		Иначе
			СтрокаГруппыПравил.ПолноеНаименование = НаименованиеРодителя + "\" + ЗаменитьНеправильныеСимволыВСтроке(Выборка.Наименование, ПреобразованныеГруппы);
		КонецЕсли;
		
		ЗаполнитьТаблицуГруппПравил(ТаблицаГруппыПравил, СтрокаГруппыПравил.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГруппуПравилСтрокойИзЗапроса(ТаблицаГруппыПравил, Запрос, ПреобразованныеГруппы)
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаГруппаПравил = ТаблицаГруппыПравил.Найти(Выборка.Группа, "Ссылка");
		Если СтрокаГруппаПравил = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найдена группа правил ""%1"" в таблице описаний групп правил.'"),
				Выборка.УдалитьГруппа);
		КонецЕсли;
		
		ЭлементПравилОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементПравилОбъект.ГруппаПравил = ЗаменитьНеправильныеСимволыВСтроке(СтрокаГруппаПравил.ПолноеНаименование, ПреобразованныеГруппы);
		ЭлементПравилОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементПравилОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаменитьНеправильныеСимволыВСтроке(Знач ИмяГруппы, ПреобразованныеГруппы) 
	ИмяГруппы = СокрЛП(ИмяГруппы);
	НовоеИмяГруппы = ПреобразованныеГруппы.Получить(ИмяГруппы);
	Если НовоеИмяГруппы <> Неопределено Тогда
		Возврат НовоеИмяГруппы;
	КонецЕсли;
	НовоеИмяГруппы = "";
	Для Сч = 1 По СтрДлина(ИмяГруппы) Цикл
		ТекСимвол = Сред(ИмяГруппы, Сч, 1);
		Если ТекСимвол = "_" Или ТекСимвол = "\" Или ТекСимвол = " "
			Или СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекСимвол)
			Или СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(ТекСимвол)
			Или СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ТекСимвол) Тогда
			НовоеИмяГруппы = НовоеИмяГруппы + ТекСимвол;
		Иначе
			НовоеИмяГруппы = НовоеИмяГруппы + " ";
		КонецЕсли;
	КонецЦикла;
	
	НовоеИмяГруппы = СтрЗаменить(НовоеИмяГруппы, "    ", " ");
	НовоеИмяГруппы = СтрЗаменить(НовоеИмяГруппы, "   ", " ");
	НовоеИмяГруппы = СтрЗаменить(НовоеИмяГруппы, "  ", " ");
	ПреобразованныеГруппы.Вставить(ИмяГруппы, НовоеИмяГруппы);
	Возврат НовоеИмяГруппы;
КонецФункции

Функция НайтиСоздатьГруппуСвойств(ВыборкаГруппа)
	Если ПустаяСтрока(ВыборкаГруппа.ГруппаСвойствКонфигурации)
		И ПустаяСтрока(ВыборкаГруппа.ГруппаСвойствФормата) Тогда
		// Родитель не требуется.
		Возврат Справочники.ПравилаКонвертацииСвойств.ПустаяСсылка();
	КонецЕсли;
	СтруктураПоиска = Новый Структура("Владелец, СвойствоКонфигурации, СвойствоФормата",
		ВыборкаГруппа.Владелец, ВыборкаГруппа.ГруппаСвойствКонфигурации, 
		ВыборкаГруппа.ГруппаСвойствФормата);
	СтруктураПоиска.Вставить("ЭтоГруппа", Истина);
	РезультатПоиска = НайтиПКС(СтруктураПоиска);
	Если РезультатПоиска <> Неопределено Тогда
		Возврат РезультатПоиска;
	КонецЕсли;
	НоваяГруппаСвойств = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
	НоваяГруппаСвойств.Владелец = ВыборкаГруппа.Владелец;
	НоваяГруппаСвойств.СвойствоКонфигурацииСтрокой = ВыборкаГруппа.ГруппаСвойствКонфигурации;
	НоваяГруппаСвойств.СвойствоФормата = ВыборкаГруппа.ГруппаСвойствФормата;
	НоваяГруппаСвойств.Наименование = СформироватьНаименование(ВыборкаГруппа.ГруппаСвойствКонфигурации, 
		ВыборкаГруппа.ГруппаСвойствФормата, ВыборкаГруппа.ИспользоватьДляОтправки, 
		ВыборкаГруппа.ИспользоватьДляПолучения);
	НоваяГруппаСвойств.Записать();
	Возврат НоваяГруппаСвойств.Ссылка;
КонецФункции

Функция НайтиПКС(ПараметрыПоиска)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКО И ЭтоГруппа = &ЭтоГруппа 
	|И СвойствоКонфигурацииСтрокой = &СвойствоКонфигурации И СвойствоФормата = &СвойствоФормата";
	Запрос.УстановитьПараметр("ПКО", ПараметрыПоиска.Владелец);
	Запрос.УстановитьПараметр("СвойствоКонфигурации", ПараметрыПоиска.СвойствоКонфигурации);
	Запрос.УстановитьПараметр("СвойствоФормата", ПараметрыПоиска.СвойствоФормата);
	Запрос.УстановитьПараметр("ЭтоГруппа", ПараметрыПоиска.ЭтоГруппа);
	Если ПараметрыПоиска.Свойство("Родитель") Тогда
		Запрос.Текст = Запрос.Текст + " И Родитель = &Родитель";
		Запрос.УстановитьПараметр("Родитель", ПараметрыПоиска.Родитель);
	КонецЕсли;
	ВыборкаПоиск = Запрос.Выполнить().Выбрать();
	Если ВыборкаПоиск.Следующий() Тогда
		Возврат ВыборкаПоиск.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция СформироватьНаименование(СвойствоКонфигурации, СвойствоФормата, ИспользоватьДляОтправки, ИспользоватьДляПолучения)
	Если ИспользоватьДляОтправки И ИспользоватьДляПолучения Тогда
		Разделитель = "<-->";
	ИначеЕсли ИспользоватьДляОтправки Тогда
		Разделитель = "-->";
	Иначе
		Разделитель = "<--";
	КонецЕсли;
	Возврат "" + СвойствоКонфигурации + Разделитель + СвойствоФормата;

КонецФункции

// Служебная процедура, находит или создает тег для правила регистрации
Функция НайтиСоздатьТег(Регистрация, ТегСтрокой)
	Если ТегСтрокой = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекТегСсылка = Справочники.Теги.НайтиПоНаименованию(ТегСтрокой,,,Регистрация);
	Если ЗначениеЗаполнено(ТекТегСсылка) Тогда 
		Возврат ТекТегСсылка;
	КонецЕсли;
	ТекТегОбъект = Справочники.Теги.СоздатьЭлемент();
	ТекТегОбъект.Наименование = ТегСтрокой;
	ТекТегОбъект.Владелец = Регистрация;
	ТекТегОбъект.ОбменДанными.загрузка = Истина; 
	ТекТегОбъект.Записать();
	Возврат ТекТегОбъект.Ссылка;
КонецФункции
#КонецОбласти
